#### StructuralSectionUtils Members

---

|  |
| --- |
| StructuralSectionUtils Class   Methods   See Also |

The  StructuralSectionUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetStructuralElementDefinitionData | Return structural element definition data. |
| Public method Static member | GetStructuralSection | Return structural section from element. |
| Public method Static member | SetStructuralSection | Set structural section in element. |

# See Also

StructuralSectionUtils Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace